//-----------------------------------------------------------------------------------
/*
	F's Plugins for VS2010/VS2012
*/
//-----------------------------------------------------------------------------------

//FsAE
#pragma once
#ifndef FsAE_H
#define FsAE_H

//******************************************************************************

#include "Fs.h"

#include "FsUtils.h"
#include "FsBuffer.h"
#include "FsVersion.h"

#ifndef NO_USE_FSGRAPHICS
	#include "FsGraphics.h"
#endif

#include <vector>
enum
{
	FsAE_NONE = 0,
	FsAE_ABOUT,
	FsAE_GLOBAL_SETUP,
	FsAE_GLOBAL_SETDOWN,
	FsAE_PARAMS_SETUP,
	FsAE_SEQUENCE_SETUP,
	FsAE_SEQUENCE_SETDOWN,
	FsAE_SEQUENCE_RESETUP,
	FsAE_RENDER,
	FsAE_SMART_PR_ERENDER,
	FsAE_SMART_RENDER,
	FsAE_DO_DIALOG,
	FsAE_USER_CHANGED_PARAM,
	FsAE_QUERY_DYNAMIC_FLAGS

};


#define FsAE_ERR	PF_Err_BAD_CALLBACK_PARAM
//-----------------------------------------------------------------------------------
/*
	プラグインID獲得のための構造体
*/
typedef struct {
	PF_Boolean		initializedB;
	AEGP_PluginID	my_id;
} ae_global_data, *ae_global_dataP, **ae_global_dataH;
//-----------------------------------------------------------------------------------
typedef struct FsPixelCopyParam{
	A_long srcX;
	A_long srcY;
	A_long dstX;
	A_long dstY;
	A_long width;
	A_long height;
}FsPixelCopyParam;


//******************************************************************************
#define FS_SCRIPT_ALERT	"alert(%s);\r\n"

#define FS_ABOUT_DIALOG	"var  FsAbout = function()\r\n\
{\r\n\
	var strName = \"%s\";\r\n\
	var strVersion = \"ver %d.%d [%s]\";\r\n\
	var strDis = \"%s\";\r\n\
	var strMyName = \"https://github.com/bryful : bryful@gmail.com \";\r\n\
    var nanae = \"Nanae Furuhashi - My beloved daughter. May she rest in peace.\";\r\n\
	var winObj = new Window(\"dialog\", \"NF's Plugins\", [ 0,  0,  480, 180] );\r\n\
\
	var edFsName = winObj.add(\"edittext\", [  30,   10,   30+ 440,   10+  20], strName, { readonly:true, borderless:true });\r\n\
	var edFsVersion = winObj.add(\"edittext\", [  30,   40,   30+ 440,   40+ 20], strVersion, { readonly:true, borderless:true });\r\n\
	var edFsDis = winObj.add(\"edittext\", [  30,   70,   30+ 440,   70+  20], strDis, { readonly:true, borderless:true });\r\n\
	var edMyName = winObj.add(\"edittext\", [  30,  100,   30+ 440,  100+  20], strMyName, { readonly:true, borderless:true });\r\n\
    var stNana = winObj.add(\"statictext\", [  30,  130,   30+ 440,  130+  20], nanae, { readonly:true, borderless:true });\r\n\
	var btnOK = winObj.add(\"button\", [ 360,  140,  360+ 100,  140+  24], \"OK\" , { name:\"ok\" });\r\n\
	this.show = function()\r\n\
	{\r\n\
		winObj.center();\r\n\
		return winObj.show();\r\n\
	}\r\n\
}\r\n\
var dlg = new FsAbout;\r\n\
dlg.show();\r\n"

#include "dialog_jsx.h"
#define FsAE_ITEM_COUNT	256

//******************************************************************************
//-----------------------------------------------------------------------------
//描画に必要な情報を集めた構造体
typedef struct{
	//
	/*01*/PF_InData			*in_data;
	/*02*/PF_OutData		*out_data;
	//
	/*03*/PF_EffectWorld	*input;
	/*04*/PF_EffectWorld	*output;
	//
	/*05*/PF_PixelPtr		inData;
	/*06*/PF_PixelPtr		outData;
	/*07*/PF_Boolean		is16Bit;

	/*08*/A_long			width;
	/*09*/A_long			height;
	/*10*/A_long			inWidthTrue;
	/*11*/A_long			outWidthTrue;
	/*12*/A_long			offsetInWidth;
	/*13*/A_long			offsetOutWidth;
	/*14*/A_long			currentFrame;
	/*15*/PF_PixelFormat	pixelFormat;
	/*16*/A_long			reserve2;
} AEInfo;
//******************************************************************************
class CFsAE{
private:
protected:
	PF_PixelFormat		m_format;
	A_long				m_frame;
	A_long				m_cmd;
	A_long				m_paramsCount;
	PF_Err				m_resultErr;
	PF_Boolean			m_isGetEffectStream;
	PF_EffectWorld		m_tmp;

	PF_EffectWorld		m_buf1;
	PF_EffectWorld		m_buf2;

public:
	//--------------------------------------------------------------------
	PF_InData			*in_data;
	PF_OutData			*out_data;
	PF_ParamDef			*params[FsAE_ITEM_COUNT];

	PF_SmartRenderExtra	*SRextraP;
	PF_PreRenderExtra	*PRextraP;
	PF_WorldSuite2		*ws2P;

	PF_EffectWorld		*input;
	PF_EffectWorld		*output;
	PF_EffectWorld		*tmpP;

	PF_EffectWorld		*buf1P;
	PF_EffectWorld		*buf2P;
	
#ifndef NO_USE_FSGRAPHICS
	CFsGraph*			in;
	CFsGraph*			out;
	CFsGraph*			tmp;
	CFsGraph*			buf1;
	CFsGraph*			buf2;
#endif	
	PF_Handle			PreRenderH;
	AEGP_SuiteHandler	*suitesP;
	PF_Iterate8Suite1*	iterS;
	PF_Handle			ae_plugin_idH;
